; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	image1 - mode
	image0 - mode
	thermograph2 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star7 - direction
	Star9 - direction
	Star8 - direction
	Star2 - direction
	Star5 - direction
	Star1 - direction
	GroundStation0 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star9)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image0)
	(supports instrument2 thermograph2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star6)
	(supports instrument5 image0)
	(supports instrument5 thermograph2)
	(supports instrument5 image1)
	(calibration_target instrument5 Star7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star9)
	(supports instrument7 thermograph2)
	(supports instrument7 image1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 Star8)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star12)
	(supports instrument8 image1)
	(supports instrument8 thermograph2)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 Star1)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
)
(:goal (and
	(pointing satellite3 Star6)
	(have_image Star10 image1)
	(have_image Planet11 thermograph2)
	(have_image Star12 thermograph2)
	(have_image Star13 image1)
	(have_image Phenomenon14 image0)
	(have_image Star15 image1)
	(have_image Star16 thermograph2)
	(have_image Phenomenon17 image0)
))

)

; plan
1. (turn_to satellite0 groundstation4 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 star10 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star10)
   goals met: 0 of 9
5. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 1 of 9
6. (turn_to satellite0 planet11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet11)
   goals met: 1 of 9
7. (take_image satellite0 planet11 instrument0 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon17 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon17 instrument0 image0)
   added: (have_image phenomenon17 image0)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon14 instrument0 image0)
   added: (have_image phenomenon14 image0)
   goals met: 4 of 9
12. (turn_to satellite0 star12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star12)
   goals met: 4 of 9
13. (take_image satellite0 star12 instrument0 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 5 of 9
14. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 5 of 9
15. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 6 of 9
16. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 6 of 9
17. (take_image satellite0 star15 instrument0 image1)
   added: (have_image star15 image1)
   goals met: 7 of 9
18. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 7 of 9
19. (take_image satellite0 star16 instrument0 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 8 of 9
20. (turn_to satellite3 star6 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star6)
   goals met: 9 of 9
